'''
Ограничение по времени: 1 секунда
Ограничение по памяти: 256 мегабайт
У радиолюбителя Алексея есть девятисегментный жидкокристаллический индикатор, который может
показывать цифры от 0 до 9 в виде цифр «почтового индекса» (см. рисунок):

После неудачного эксперимента индикатор повредился, и часть сегментов могла перегореть. Когда
сегмент перегорает, индикатор теряет возможность показывать цифры, использующие этот сегмент.
Алексей уже выяснил, что индикатор всё ещё способен показать какие‑то n цифр. Однако
радиолюбитель не может проверить остальные цифры, равно как и каждый сегмент отдельно. Поэтому
он просит вас помочь найти те цифры, которые гарантированно можно показать на этом индикаторе.

Формат входных данных
Первая строка входных данных содержит число n (1≤n≤10) — количество цифр, которые смог показать
на индикаторе Алексей.
Следующие n строк содержат по одной цифре ai (0≤ai≤9) — сами цифры, которые Алексей смог показать.
Гарантируется, что все ai различны.

Формат выходных данных
Выведите элементы искомого множества в порядке возрастания, каждую цифру в отдельной строке.
'''

#Смотреть решение у Матвея.
