t = int(input())

for i in range(t):
    n, m = map(int, input().split())
    
    s = int((n * m + 1) * (n * m / 2) / 2)
    print('всего чисел -', n * m) ########
    print('половина суммы -', s) ########
    print('шаг между колонками -', n) ########
    print('шаг между строками -', m * m) ########
    
    print('ближайшее слева -', s // n) ########
    print('ближайшее справа -', 0) ########
    print('ближайшее сверху -', 0) ########
    print('ближайшее снизу -', 0) ########
    print('максимально близкое к середине -', 0) ########